Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དེ་ལ་རྡོ་རྗེའི་དཀྱིལ་འཁོར་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་འཛིན་པ་སྟེ།
en: If you ask what is (24) the meditative stability named vajra maṇḍala, abiding in that meditative stability, one apprehends the maṇḍalas of all meditative stabilities.

source: འདི་ནི་རྡོ་རྗེའི་དཀྱིལ་འཁོར་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named vajra maṇḍala.

source: །དེ་ལ་རྒྱལ་མཚན་གྱི་རྩེ་མོའི་དཔུང་རྒྱན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཇི་ལྟར་རྒྱལ་མཚན་དམ་པ་བཞིན། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལས་འཕགས་པ་སྟེ།
en: If you ask what is (25) the meditative stability named shoulder ornament of the victory banner’s crest, abiding in that meditative stability, one rises above all meditative concentrations, like a sacred victory banner.

source: འདི་ནི་རྒྱལ་མཚན་གྱི་རྩེ་མོའི་དཔུང་རྒྱན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named shoulder ornament of the victory banner’s crest.

source: །དེ་ལ་དབང་པོའི་དཔལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་དབང་དམ་པ་ཐོབ་པ་སྟེ།
en: If you ask what is (26) the meditative stability named crest of power, abiding in that meditative stability, one obtains genuine power over all meditative stabilities.

source: འདི་ནི་དབང་པོའི་དཔལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named crest of power.

source: །དེ་ལ་རྒྱུན་གྱི་རྗེས་སུ་སོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། རྒྱུན་གྱི་རྗེས་སུ་མ་ལོག་པར་ཡང་དག་པར་ཞུགས་པ་སྟེ།
en: If you ask what is (27) the meditative stability named pursuit of the stream, abiding in that meditative stability, one embarks in pursuit of the stream without error.

source: འདི་ནི་རྒྱུན་གྱི་རྗེས་སུ་སོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named pursuit of the stream.

source: །དེ་ལ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། རྡུལ་དང་དྲི་མ་ཐམས་ཅད་རབ་ཏུ་སྤང་བའི་དབང་དུ་གྱུར་ཅིང་། ཇི་ལྟར་སེང་གེའི་རྒྱལ་པོ་བཞིན་དབང་ཐོབ་པས་བསྒྱིངས་པ་ལྟ་བུ་སྟེ།
en: If you ask what is (28) the meditative stability named yawning lion, abiding in that meditative stability, one acquires the ability to abandon all stains and defilements, and by acquiring that ability, one yawns like the king of lions.

source: འདི་ནི་སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named yawning lion.

source: །དེ་ལ་སྣྲེལ་ཞི་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། འཁོར་བའི་ཆོས་རྣམས་རྒྱུན་གཅོད་པར་བྱེད་པ་སྟེ།
en: If you ask what is (29) the meditative stability named out of order, abiding in that meditative stability, one interrupts the continuity of the phenomena of cyclic existence.

source: འདི་ནི་སྣྲེལ་ཞི་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named out of order. {

source: །དེ་ལ་ཉོན་མོངས་པ་སྤོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱི་དྲི་མ་རབ་ཏུ་སེལ་བ་སྟེ།
en: Dt.200} If you ask what is (30) the meditative stability named repudiation of mental afflictions, abiding in that meditative stability, one dispels the stains of all mental afflictions.

source: འདི་ནི་ཉོན་མོངས་པ་སྤོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named repudiation of mental afflictions.

source: །དེ་ལ་རྣམ་པར་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལྷམ་མེ།
en: If you ask what is (31) the meditative stability named illumination, abiding in that meditative stability, one illuminates, heats, and bedazzles all meditative stabilities.

source: ལྷན་ནེ། ལྷང་ངེར་བྱེད་པ་སྟེ། འདི་ནི་རྣམ་པར་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named illumination.

source: །དེ་ལ་ཚོལ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཆོས་གང་ཡང་ཚོལ་བ་མེད་པ་སྟེ།
en: If you ask what is (32) the meditative stability named unseeking, abiding in that meditative stability, nothing at all is sought.

source: འདི་ནི་ཚོལ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named unseeking.

source: །དེ་ལ་གནས་ལ་རྟེན་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཆོས་གང་ཡང་གནས་ལ་རྟེན་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་སྟེ།
en: If you ask what is (33) the meditative stability named no fixed abode, abiding in that meditative stability, one does not observe anything at all that is fixed as an abode.

source: འདི་ནི་གནས་ལ་རྟེན་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named no fixed abode.

source: །དེ་ལ་སེམས་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། སེམས་ཀྱང་མི་འབྱུང་། སེམས་ལས་བྱུང་བ་རྣམས་ཀྱང་མི་རྒྱུ་བ་སྟེ།
en: If you ask what is (34) the meditative stability named free from mentation, abiding in that meditative stability, mentation does not at all arise, nor are mental states in motion.

source: འདི་ནི་སེམས་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named free from mentation.

source: །དེ་ལ་དྲི་མ་མེད་པའི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་སྒྲོན་མ་དྲི་མ་མེད་པར་བྱེད་པ་སྟེ།
en: If you ask what is (35) the meditative stability named taintless lamp, abiding in that meditative stability, one acts as the taintless lamp of all meditative stabilities.

source: འདི་ནི་དྲི་མ་མེད་པའི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named taintless lamp.

source: །དེ་ལ་འོད་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་།
en: If you ask what is (36) the meditative stability named boundless light, abiding in that meditative stability, one generates boundless light.

source: འོད་མཐའ་ཡས་པར་བྱེད་པ་སྟེ། འདི་ནི་འོད་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named boundless light.

source: །དེ་ལ་འོད་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་འདི་ཐོབ་མ་ཐག་ཏུ། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་འོད་བྱེད་པ་སྟེ།
en: If you ask what is (37) the meditative stability named illuminator, abiding in that meditative stability, one illuminates all meditative concentrations immediately after that meditative stability has been attained.

source: འདི་ནི་འོད་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named illuminator.

source: །དེ་ལ་ཀུན་དུ་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་དེ་ཐོབ་མ་ཐག་ཏུ་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་སྒོ་སྣང་བར་བྱེད་པ་སྟེ།
en: If you ask what is (38) the meditative stability named total illumination, abiding in that meditative stability, one illuminates the gateways of all meditative concentrations immediately after that meditative stability has been attained.

source: འདི་ནི་ཀུན་དུ་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named total illumination.

source: །དེ་ལ་དག་པ་དམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་དག་པ་མཉམ་པ་ཉིད་འཐོབ་པ་སྟེ།
en: If you ask what is (39) the meditative stability named pure sanctuary, abiding in that meditative stability, one will acquire pure equanimity with respect to all meditative stabilities.

source: འདི་ནི་དག་པ་དམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named pure sanctuary.

source: །དེ་ལ་འོད་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་དྲི་མ་སེལ་བ་སྟེ།
en: If you ask what is (40) the meditative stability named immaculate light, abiding in that meditative stability, one dispels the stains of all meditative stabilities.

source: འདི་ནི་འོད་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named immaculate light.

source: །དེ་ལ་དགའ་བ་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་དགའ་བ་ཉམས་སུ་མྱོང་བར་འགྱུར་བ་སྟེ།
en: If you ask what is (41) the meditative stability named bringer of joy, abiding in that meditative stability, one experiences the joy of all meditative stabilities.

source: འདི་ནི་དགའ་བ་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named bringer of joy.

source: །དེ་ལ་གློག་གི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་སྒྲོན་མ་བྱེད་པ་སྟེ།
en: If you ask what is (42) the meditative stability named lightning lamp, abiding in that meditative stability, one gives light to all meditative stabilities.

source: འདི་ནི་གློག་གི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named lightning lamp.

source: །དེ་ལ་ཟད་མི་ཤེས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཟད་ཤེས་པ་དང་། ཟད་མི་ཤེས་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་སྟེ།
en: If you ask what is (43) the meditative stability named inexhaustible, abiding in that meditative stability, one does not consider whether any meditative stabilities are exhaustible or not exhaustible.

source: འདི་ནི་ཟད་མི་ཤེས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named inexhaustible.

source: །དེ་ལ་མི་འཕམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་སྟོབས་རབ་ཏུ་ཐོབ་པ་སྟེ།
en: If you ask what is (44) the meditative stability named unvanquished, abiding in that meditative stability, one acquires power over all meditative stabilities.

source: འདི་ནི་མི་འཕམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named unvanquished.

source: །དེ་ལ་གཟི་བརྗིད་ཡོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་གཟི་བརྗིད་དང་། དཔལ་གྱིས་འབར་བར་འགྱུར་བ་སྟེ།
en: If you ask what is (45) the meditative stability named majestic, abiding in that meditative stability, one becomes majestic and blazes with splendor with respect to all meditative stabilities.

source: འདི་ནི་གཟི་བརྗིད་ཡོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named majestic.

source: །དེ་ལ་ཟད་པ་དང་བྲལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཟད་མི་ཤེས་པར་རྗེས་སུ་མཐོང་ནས། རྡུལ་ཙམ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་དེ་ལྟར་མཐོང་བ་སྟེ།
en: If you ask what is (46) the meditative stability named free from extinction, abiding in that meditative stability, one observes that all meditative stabilities are inextinguishable and then regards them in such a way that one does not observe them even in the slightest.

source: འདི་ནི་ཟད་པ་དང་བྲལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named free from extinction.

source: །དེ་ལ་མི་གཡོ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་མི་གཡོ། མི་འགུལ། རབ་ཏུ་མི་འབྱེད།
en: If you ask what is (47) the meditative stability named unmoving, abiding in that meditative stability, one neither wavers nor vacillates with respect to any meditative stability, nor does one engage with them or give rise to conceits about them.

source: རློམ་སེམས་སུ་མི་བྱེད་པ་སྟེ། འདི་ནི་མི་གཡོ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named unmoving.

source: །དེ་ལ་འཇིག་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་འཇིག་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་སྟེ།
en: If you ask what is (48) the meditative stability named imperishable, abiding in that meditative stability, one does not observe any meditative stabilities to perish.

source: འདི་ནི་འཇིག་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named imperishable.

source: །དེ་ལ་ཉི་མའི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་སྒོ་སྣང་བར་བྱེད་པ་སྟེ།
en: If you ask what is (49) the meditative stability named lamp of the sun, abiding in that meditative stability, one illuminates the gateways of all meditative stabilities.

source: འདི་ནི་ཉི་མའི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named lamp of the sun.

source: །དེ་ལ་ཟླ་བ་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་མུན་པ་མེད་པར་བྱེད་པ་སྟེ།
en: If you ask what is (50) the meditative stability named immaculate moon, abiding in that meditative stability, one eliminates darkness with respect to all meditative stabilities.

source: འདི་ནི་ཟླ་བ་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named immaculate moon.

source: །དེ་ལ་ཤེས་རབ་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ཤེས་རབ་ཀྱི་འོད་ཀྱིས་མ་རིག་པའི་མུན་པ་ཐམས་ཅད་བསལ་བར་བྱེད་པ་སྟེ།
en: If you ask what is (51) the meditative stability named lamp of wisdom, abiding in that meditative stability, one dispels all the darkness of ignorance with the light of wisdom with respect to all meditative stabilities.

source: འདི་ནི་ཤེས་རབ་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named lamp of wisdom.

source: །དེ་ལ་སྣང་བ་གསལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་རབ་ཏུ་འཐོབ་པ་སྟེ།
en: If you ask what is (52) the meditative stability named pure appearance, abiding in that meditative stability, one acquires the four kinds of exact knowledge with respect to all meditative stabilities.

source: འདི་ནི་སྣང་བ་གསལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named pure appearance. {

source: །དེ་ལ་སྣང་བ་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་སྒོ་སྣང་བར་བྱེད་པ་སྟེ།
en: Dt.201} “If you ask what is (53) the meditative stability named illuminating, abiding in that meditative stability, one illuminates the gateways of all meditative stabilities.

source: འདི་ནི་སྣང་བ་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named illuminating.

source: །དེ་ལ་བྱ་བ་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་བྱ་བ་རྣམས་བྱེད་པ་སྟེ།
en: If you ask what is (54) the meditative stability named engaging in performance, abiding in that meditative stability, one engages in the performance of all meditative stabilities.

source: འདི་ནི་བྱ་བ་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named engaging in performance.

source: །དེ་ལ་ཡེ་ཤེས་དཔལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་དཔལ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་སྟེ།
en: If you ask what is (55) the meditative stability named crest of wisdom, abiding in that meditative stability, one contemplates the crest of wisdom with respect to all meditative stabilities.

source: འདི་ནི་ཡེ་ཤེས་དཔལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named crest of wisdom.

source: །དེ་ལ་རྡོ་རྗེ་ལྟ་བུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་ཏིང་ངེ་འཛིན་ཉིད་ཀྱང་། ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བར་ཁོང་དུ་ཆུད་པར་བྱེད་པ་སྟེ།
en: If you ask what is (56) the meditative stability named vajra-like, abiding in that meditative stability, one comprehends all meditative stabilities without observing even the nature of those meditative stabilities.

source: འདི་ནི་རྡོ་རྗེ་ལྟ་བུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named vajra-like.

source: །དེ་ལ་སེམས་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། སེམས་མི་གཡོ། རྣམ་པར་མི་གཡོ། རྣམ་པར་མི་ལྡོག་ཡོངས་སུ་ཡིད་འཆད་པར་མི་འགྱུར།
en: If you ask what is (57) the meditative stability named stability of mind, abiding in that meditative stability, one’s mind neither wavers nor vacillates, nor is it diverted, nor is it terrified, nor does it fail, and nor does it have occasion to think, ‘That which is called mind is this.’

source: ཉམས་སུ་མི་བདེ་བ་མེད་ལ། དེ་ལ་སེམས་ཞེས་བྱ་བ་ནི་འདི་ཡིན་ཞེས་བྱ་བར་སེམས་མི་འབྱུང་བ་སྟེ། འདི་ནི་སེམས་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named stability of mind.

source: །དེ་ལ་ཀུན་དུ་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་སྣང་བར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་སྟེ།
en: If you ask what is (58) the meditative stability named observing everything, abiding in that meditative stability, one observes the appearance of all meditative stabilities.

source: །དེ་ལ་རབ་ཏུ་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་རབ་ཏུ་གནས་པར་འགྱུར་བ་སྟེ།
en: If you ask what is (59) the meditative stability named consecrated, abiding in that meditative stability, one is consecrated in all meditative stabilities.

source: འདི་ནི་རབ་ཏུ་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named consecrated.

source: །དེ་ལ་རིན་ཆེན་མཐའ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་རིན་ཆེན་མཐའ་ལྟར་ཀུན་ནས་སྣང་བ་སྟེ།
en: If you ask what is (60) the meditative stability named jewel cusp, abiding in that meditative stability, all meditative stabilities shine on all sides in the manner of a jewel cusp.

source: འདི་ནི་རིན་ཆེན་མཐའ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named jewel cusp.

source: །དེ་ལ་ཆོས་དམ་པའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཕྱག་རྒྱ་མེད་པའི་མཐས་ཕྱག་རྒྱས་བཏབ་པར་ཉེ་བར་བཟུང་བས་ཕྱག་རྒྱས་བཏབ་པར་འགྱུར་བ་སྟེ།
en: If you ask what is (61) the meditative stability named seal of the Dharma, abiding in that meditative stability, all meditative stabilities are sealed because they are sealed with the beginningless seal.

source: འདི་ནི་ཆོས་དམ་པའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named seal of the Dharma.

source: །དེ་ལ་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཅེས་བྱ་བའི་ཏི་ང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཆོས་གང་ཡང་མཉམ་པ་ཉིད་དུ་མ་ཆུད་པ་མེད་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་སྟེ།
en: If you ask what is (62) the meditative stability named sameness of all phenomena, abiding in that meditative stability, one observes that there is nothing at all that is excluded from sameness.

source: འདི་ནི་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named sameness of all phenomena.

source: །དེ་ལ་དགའ་བ་སྤོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་ཆོས་ཐམས་ཅད་ཀྱི་དགའ་བ་སྤོང་བ་སྟེ།
en: If you ask what is (63) the meditative stability named renunciation of delight, abiding in that meditative stability, one renounces the delight associated with all meditative stabilities and all phenomena.

source: འདི་ནི་དགའ་བ་སྤོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named renunciation of delight.

source: །དེ་ལ་ཆོས་ཀྱིས་འཕགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཆོས་ཐམས་ཅད་ཀྱི་མུན་པ་སེལ་བ་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱིས་མངོན་པར་འཕགས་པར་འགྱུར་བ་སྟེ།
en: If you ask what is (64) the meditative stability named sublimation of phenomena, abiding in that meditative stability, one dispels the darkness of all phenomena and sublimates them by means of all the meditative stabilities.

source: འདི་ནི་ཆོས་ཀྱིས་འཕགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named sublimation of phenomena.

source: །དེ་ལ་རྣམ་པར་འཐོར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཆོས་ཐམས་ཅད་རྣམ་པར་འཐོར་བ་སྟེ།
en: If you ask what is (65) the meditative stability named dispersal, abiding in that meditative stability, one disperses all phenomena.

source: འདི་ནི་རྣམ་པར་འཐོར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named dispersal.

source: །དེ་ལ་ཆོས་ཐམས་ཅད་ཀྱི་ཚིག་རབ་ཏུ་འབྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིངའཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། ཆོས་ཐམས་ཅད་ཀྱི་ཚིག་རབ་ཏུ་འབྱེད་པ་སྟེ།
en: If you ask what is (66) the meditative stability named distinguishing the terms associated with all phenomena, abiding in that meditative stability, one distinguishes between the terms associated with all meditative stabilities and all phenomena.

source: འདི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་ཚིག་རབ་ཏུ་འབྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named distinguishing the terms associated with all phenomena.

source: །དེ་ལ་ཡི་གེ་མཉམ་པར་འགོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ཡི་གེ་མཉམ་པ་ཉིད་རབ་ཏུ་འཐོབ་པ་སྟེ།
en: If you ask what is (67) the meditative stability named establishing the sameness of letters, abiding in that meditative stability, one acquires the sameness associated with the letters that represent all meditative stabilities.

source: འདི་ནི་ཡི་གེ་མཉམ་པར་འགོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named establishing the sameness of letters.

source: །དེ་ལ་ཡི་གེ་དང་བྲལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ཡི་གེ་གཅིག་ཀྱང་དམིགས་སུ་མེད་པ་སྟེ།
en: If you ask what is (68) the meditative stability named devoid of letters, abiding in that meditative stability, one does not apprehend even a single letter representing all the meditative stabilities.

source: འདི་ནི་ཡི་གེ་དང་བྲལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named devoid of letters.

source: །དེ་ལ་དམིགས་པ་གཅོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་དམིགས་པ་འཆད་པར་འགྱུར་བ་སྟེ།
en: If you ask what is (69) the meditative stability named eradication of referents, abiding in that meditative stability, one eradicates references to all meditative stabilities.

source: འདི་ནི་དམིགས་པ་གཅོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named eradication of referents.

source: །དེ་ལ་འགྱུར་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཆོས་ཐམས་ཅད་འགྱུར་བར་མི་དམིགས་པ་སྟེ།
en: If you ask what is (70) the meditative stability named unmodified, abiding in that meditative stability, one does not apprehend any phenomena that are modified.

source: འདི་ནི་འགྱུར་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named unmodified.

source: །དེ་ལ་རྣམ་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་པ་ཙམ་ཡང་དམིགས་པ་མེད་པ་སྟེ།
en: If you ask what is (71) the meditative stability named no aspect, abiding in that meditative stability, one does not apprehend any aspects at all with respect to any phenomena.

source: འདི་ནི་རྣམ་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named no aspect.

source: །དེ་ལ་མིང་ངེས་པར་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ངེས་པའི་ཚིག་ཐམས་ཅད་ནི་ཡང་དག་པར་དམིགས་སུ་མེད་ཅིང་། ཐ་སྙད་ལ་ལྟོས་པ་ཙམ་མོ། །ཞེས་རྟོགས་པར་འཇུག་པ་སྟེ།
en: If you ask what is (72) the meditative stability named ascertainment of names, abiding in that meditative stability, all etymologies are nonapprehensible and one begins to understand that these are merely conventional expressions.

source: འདི་ནི་མིང་ངེས་པར་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named ascertainment of names.

source: །དེ་ལ་གནས་མེད་པར་སྤྱོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་དེ་ཐམས་ཅད་ཀྱི་གནས་དམིགས་པ་མེད་པ་སྟེ།
en: If you ask what is (73) the meditative stability named roaming, abiding in that meditative stability, one does not apprehend a fixed abode with respect to any meditative stability.

source: འདི་ནི་གནས་མེད་པར་སྤྱོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named roaming.

source: །དེ་ལ་རབ་རིབ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཆོས་ཐམས་ཅད་ཀྱི་རབ་རིབ་རྣམ་པར་སེལ་བ་སྟེ།
en: If you ask what is (74) the meditative stability named devoid of darkness, abiding in that meditative stability, one dispels the darkness associated with all phenomena.

source: འདི་ནི་རབ་རིབ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named devoid of darkness.
